In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\prince\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\prince\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [106]:
import mysql.connector as conn

In [107]:
mydb=conn.connect(host = 'localhost',user='root',passwd='Mahadev12@a')

In [108]:
cursor=mydb.cursor()

In [109]:
cursor.execute(" show databases")

In [110]:
cursor.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sriv',),
 ('sys',),
 ('test',),
 ('world',)]

In [111]:
cursor=mydb.cursor()

In [113]:
cursor.execute("use test")

In [114]:
cursor.execute("show tables")

In [115]:
cursor.fetchall()

[('table1',), ('test2',), ('test3',), ('test4',), ('test5',)]

In [84]:
cursor.execute("select * from test.table1")

In [85]:
cursor.fetchall()

[(3844, 'sauarbh', 'sriv', 444, 'fsdsm'),
 (46237, 'prince', 'sriva', 347, 'cognizant')]

In [132]:
# ls

In [68]:
file=open("student_data.csv" , 'r')

In [69]:
file.read()

'1,John,Doe,Male,11\n2,Jane,Smith,Female,10\n3,Michael,Johnson,Male,12\n4,Emily,Williams,Female,11\n5,William,Brown,Male,10\n6,Sarah,Jones,Female,9\n7,James,Davis,Male,11\n8,Olivia,Miller,Female,10\n9,Robert,Anderson,Male,12\n10,Emma,Moore,Female,11\n11,David,Martin,Male,10\n12,Ava,Taylor,Female,9\n13,Joseph,Clark,Male,11\n14,Sophia,Thomas,Female,10\n15,Charles,Hall,Male,12\n16,Grace,Wilson,Female,11\n17,Daniel,White,Male,10\n18,Chloe,Lee,Female,9\n19,Matthew,Scott,Male,11\n20,Elizabeth,Harris,Female,10\n'

In [121]:
import csv
with open ("student_data.csv" , 'r') as f:
    std_data=csv.reader(f,delimiter="\n")
    for i in std_data:
        print(f"insert into test5 values ({str(i[0])})")
        cursor.execute(f"insert into test.test5 values ({str(i[0])})")
        print(i)

insert into test5 values (1,"John","Doe","Male",90)
['1,"John","Doe","Male",90']
insert into test5 values (2,"Jane","Smith","Female",85)
['2,"Jane","Smith","Female",85']
insert into test5 values (3,"Michael","Johnson","Male",78)
['3,"Michael","Johnson","Male",78']
insert into test5 values (4,"Emily","Williams","Female",92)
['4,"Emily","Williams","Female",92']
insert into test5 values (5,"William","Brown","Male",88)
['5,"William","Brown","Male",88']
insert into test5 values (6,"Sarah","Jones","Female",75)
['6,"Sarah","Jones","Female",75']
insert into test5 values (7,"James","Davis","Male",91)
['7,"James","Davis","Male",91']
insert into test5 values (8,"Olivia","Miller","Female",87)
['8,"Olivia","Miller","Female",87']
insert into test5 values (9,"Robert","Wilson","Male",82)
['9,"Robert","Wilson","Male",82']
insert into test5 values (10,"Emma","Martin","Female",89)
['10,"Emma","Martin","Female",89']
insert into test5 values (11,"David","Anderson","Male",79)
['11,"David","Anderson","Male",79']
insert into test5 values (12,"Sophia","Martinez","Female",94)
['12,"Sophia","Martinez","Female",94']
insert into test5 values (13,"Joseph","Lopez","Male",84)
['13,"Joseph","Lopez","Male",84']
insert into test5 values (14,"Charlotte","Hall","Female",93)
['14,"Charlotte","Hall","Female",93']
insert into test5 values (15,"Charles","Young","Male",80)
['15,"Charles","Young","Male",80']
insert into test5 values (16,"Abigail","Harris","Female",76)
['16,"Abigail","Harris","Female",76']
insert into test5 values (17,"Thomas","Clark","Male",88)
['17,"Thomas","Clark","Male",88']
insert into test5 values (18,"Ella","Lewis","Female",81)
['18,"Ella","Lewis","Female",81']
insert into test5 values (19,"Daniel","Turner","Male",77)
['19,"Daniel","Turner","Male",77']
insert into test5 values (20,"Grace","Wright","Female",90)
['20,"Grace","Wright","Female",90']

In [122]:
mydb.commit()

In [128]:
print ("hello {}".format("world"))  #using format in string

hello world

In [129]:
import pandas as pd

In [130]:
pd.read_sql("select * from test.test5",mydb)

C:\Users\prince\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    StudentID  FirstName  LastName  Gender  Grade
0           1       John       Doe    Male     90
1           2       Jane     Smith  Female     85
2           3    Michael   Johnson    Male     78
3           4      Emily  Williams  Female     92
4           5    William     Brown    Male     88
5           6      Sarah     Jones  Female     75
6           7      James     Davis    Male     91
7           8     Olivia    Miller  Female     87
8           9     Robert    Wilson    Male     82
9          10       Emma    Martin  Female     89
10         11      David  Anderson    Male     79
11         12     Sophia  Martinez  Female     94
12         13     Joseph     Lopez    Male     84
13         14  Charlotte      Hall  Female     93
14         15    Charles     Young    Male     80
15         16    Abigail    Harris  Female     76
16         17     Thomas     Clark    Male     88
17         18       Ella     Lewis  Female     81
18         19     Daniel    Turner    Male     77
19         20      Grace    Wright  Female     90

In [131]:
pd.read_sql("show tables",mydb)

C:\Users\prince\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  Tables_in_test
0         table1
1          test5